mairmaid diagrams update
